In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.51446091, -1.1206298 , -0.49002251],
       [-0.74963065,  0.02019538, -0.0533324 ],
       [ 0.69750026,  0.64338123, -0.63892942],
       [ 0.83792862, -1.32838339, -1.32064557]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame # data'mızı alıp sanki excel tablosu gibi sıralıyor

          0         1         2
0 -0.514461 -1.120630 -0.490023
1 -0.749631  0.020195 -0.053332
2  0.697500  0.643381 -0.638929
3  0.837929 -1.328383 -1.320646

In [6]:
type(dataFrame[0]) # bir seri olduğunu görüyoruz, type olmasaydı da ilk kolonu verecekti bize

pandas.core.series.Series

In [7]:
newDataFrame = pd.DataFrame(data, index = ["Ali", "Osman", "Ayse", "Ahmet"], columns = ["Maas", "Yas", "Calisma Saati"])

In [8]:
newDataFrame

           Maas       Yas  Calisma Saati
Ali   -0.514461 -1.120630      -0.490023
Osman -0.749631  0.020195      -0.053332
Ayse   0.697500  0.643381      -0.638929
Ahmet  0.837929 -1.328383      -1.320646

In [9]:
newDataFrame["Yas"] # Yaş kolonunu almak istersek bu şekilde seriyi çekebiliriz

Ali     -1.120630
Osman    0.020195
Ayse     0.643381
Ahmet   -1.328383
Name: Yas, dtype: float64

In [10]:
newDataFrame[["Yas", "Maas"]] # Birden fazla kolon da istenebilir

            Yas      Maas
Ali   -1.120630 -0.514461
Osman  0.020195 -0.749631
Ayse   0.643381  0.697500
Ahmet -1.328383  0.837929

In [11]:
newDataFrame.loc["Ali"] # Belli bir row'daki verileri almak için loc kullanıyoruz

Maas            -0.514461
Yas             -1.120630
Calisma Saati   -0.490023
Name: Ali, dtype: float64

In [12]:
newDataFrame.iloc[1] # index location'a göre de işlem yapılabilir

Maas            -0.749631
Yas              0.020195
Calisma Saati   -0.053332
Name: Osman, dtype: float64

In [13]:
newDataFrame["Emeklilik Yasi"] = newDataFrame["Yas"] + newDataFrame["Yas"] # bu şekilde yeni kolon eklenebilir

In [14]:
newDataFrame

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Ali   -0.514461 -1.120630      -0.490023       -2.241260
Osman -0.749631  0.020195      -0.053332        0.040391
Ayse   0.697500  0.643381      -0.638929        1.286762
Ahmet  0.837929 -1.328383      -1.320646       -2.656767

In [15]:
newDataFrame.drop("Emeklilik Yasi", axis=1) # kolon silmek için

           Maas       Yas  Calisma Saati
Ali   -0.514461 -1.120630      -0.490023
Osman -0.749631  0.020195      -0.053332
Ayse   0.697500  0.643381      -0.638929
Ahmet  0.837929 -1.328383      -1.320646

In [16]:
newDataFrame.drop("Ahmet", axis=0) # row silmek için

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Ali   -0.514461 -1.120630      -0.490023       -2.241260
Osman -0.749631  0.020195      -0.053332        0.040391
Ayse   0.697500  0.643381      -0.638929        1.286762

In [17]:
newDataFrame # değişiklik olmadığını görüyoruz

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Ali   -0.514461 -1.120630      -0.490023       -2.241260
Osman -0.749631  0.020195      -0.053332        0.040391
Ayse   0.697500  0.643381      -0.638929        1.286762
Ahmet  0.837929 -1.328383      -1.320646       -2.656767

In [18]:
# Dataframe de kalıcı değişiklik yapmak istiyorsak bunu ayrıca belirtmemiz gerekiyor
newDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True) # inplace => yerinde, gerçekten onun içinde işlem yap demek

In [19]:
newDataFrame

           Maas       Yas  Calisma Saati
Ali   -0.514461 -1.120630      -0.490023
Osman -0.749631  0.020195      -0.053332
Ayse   0.697500  0.643381      -0.638929
Ahmet  0.837929 -1.328383      -1.320646

In [20]:
newDataFrame.loc["Ali"]["Yas"] # Bu şekilde Ali'nin yaş bilgisine ulaşılabilir

-1.1206297952985382

In [21]:
newDataFrame.loc["Ali","Yas"] # üstteki ile aynı olacak, bu şekilde de ulaşılabilir bilgiye

-1.1206297952985382

In [22]:
newDataFrame < 0 # Bu koşula uyan ya da uymayan verileri verecek

        Maas    Yas  Calisma Saati
Ali     True   True           True
Osman   True  False           True
Ayse   False  False           True
Ahmet  False   True           True

In [23]:
booleanDataFrame = newDataFrame < 0

In [24]:
booleanDataFrame

        Maas    Yas  Calisma Saati
Ali     True   True           True
Osman   True  False           True
Ayse   False  False           True
Ahmet  False   True           True

In [25]:
newDataFrame[booleanDataFrame] # sadece ortak olan değerleri gösterecek

           Maas       Yas  Calisma Saati
Ali   -0.514461 -1.120630      -0.490023
Osman -0.749631       NaN      -0.053332
Ayse        NaN       NaN      -0.638929
Ahmet       NaN -1.328383      -1.320646

In [26]:
#üstteki ifadeyi şu şekilde de yapabiliriz
newDataFrame[newDataFrame < 0]

           Maas       Yas  Calisma Saati
Ali   -0.514461 -1.120630      -0.490023
Osman -0.749631       NaN      -0.053332
Ayse        NaN       NaN      -0.638929
Ahmet       NaN -1.328383      -1.320646

In [27]:
newDataFrame[newDataFrame["Yas"] > 0] # yaşı 0'dan büyük olan row'ları getirir sadece

           Maas       Yas  Calisma Saati
Osman -0.749631  0.020195      -0.053332
Ayse   0.697500  0.643381      -0.638929

In [28]:
newDataFrame.reset_index() # index adında yeni bir kolon oluşturur, resetler indexi

   index      Maas       Yas  Calisma Saati
0    Ali -0.514461 -1.120630      -0.490023
1  Osman -0.749631  0.020195      -0.053332
2   Ayse  0.697500  0.643381      -0.638929
3  Ahmet  0.837929 -1.328383      -1.320646

In [30]:
newIndexList = ["Al", "Os", "Ay", "Ah"]

In [32]:
newDataFrame["Yeni Index"] = newIndexList

In [34]:
newDataFrame

           Maas       Yas  Calisma Saati Yeni Index
Ali   -0.514461 -1.120630      -0.490023         Al
Osman -0.749631  0.020195      -0.053332         Os
Ayse   0.697500  0.643381      -0.638929         Ay
Ahmet  0.837929 -1.328383      -1.320646         Ah

In [35]:
newDataFrame.set_index("Yeni Index") # index'i set ettik

                Maas       Yas  Calisma Saati
Yeni Index
Al         -0.514461 -1.120630      -0.490023
Os         -0.749631  0.020195      -0.053332
Ay          0.697500  0.643381      -0.638929
Ah          0.837929 -1.328383      -1.320646

In [36]:
# Kalıcı olmasını istersek
newDataFrame.set_index("Yeni Index", inplace=True) # inplace değeri vermemiz lazım

In [37]:
newDataFrame

                Maas       Yas  Calisma Saati
Yeni Index
Al         -0.514461 -1.120630      -0.490023
Os         -0.749631  0.020195      -0.053332
Ay          0.697500  0.643381      -0.638929
Ah          0.837929 -1.328383      -1.320646

### Multi Index

In [38]:
firstIndexList = ["Simpsons","Simpsons","Simpsons", "South Park", "South Park", "South Park"]

In [39]:
secondIndexList = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [40]:
mergedIndex = list(zip(firstIndexList, secondIndexList))

In [41]:
mergedIndex

[('Simpsons', 'Homer'),
 ('Simpsons', 'Bart'),
 ('Simpsons', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [42]:
mergedIndex = pd.MultiIndex.from_tuples(mergedIndex)

In [43]:
mergedIndex

MultiIndex([(  'Simpsons',   'Homer'),
            (  'Simpsons',    'Bart'),
            (  'Simpsons',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [44]:
myCartoonList = [[40, "A"], [10, "B"], [30, "C"], [9, "D"], [10, "E"], [11, "F"]]

In [45]:
cartoonNumpy = np.array(myCartoonList)

In [46]:
cartoonDataFrame = pd.DataFrame(cartoonNumpy, index=mergedIndex, columns=["Yas", "Meslek"])

In [47]:
cartoonDataFrame

                   Yas Meslek
Simpsons   Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [49]:
cartoonDataFrame.loc["Simpsons"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [50]:
cartoonDataFrame.loc["South Park"].loc["Kyle"]

Yas       11
Meslek     F
Name: Kyle, dtype: object

In [52]:
cartoonDataFrame.index.names = ["Cartoon Name", "Character Name"]

In [53]:
cartoonDataFrame

                            Yas Meslek
Cartoon Name Character Name
Simpsons     Homer           40      A
             Bart            10      B
             Marge           30      C
South Park   Cartman          9      D
             Kenny           10      E
             Kyle            11      F